My_Home_DEV_local/src/Documents/мх_РегистрацияФизическихУпражений/мх_РегистрацияФизическихУпражений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мх_РегистрацияФизическихУпражений</name>
  <registerRecords>AccumulationRegister.мх_СтатистикаФизическихУпражнений</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизическиеУпражения</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.мх_ФизическиеУпражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.мх_ПоказателиФизическихУпражнений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

My_Home_DEV_local/src/Documents/мх_РегистрацияФизическихУпражений/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.ФизическиеУпражения.Количество() = 0 Тогда
		Объект.ФизическиеУпражения.Добавить();
		Модифицированность = Ложь;
	КонецЕсли;

	Если Объект.ФизическиеУпражения.Количество() > 1 Тогда
		НесколькоУпражнений = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НесколькоУпражненийПриИзменении(Элемент)

	Если Не НесколькоУпражнений Тогда

		Сч = Объект.ФизическиеУпражения.Количество();

		Пока Сч > 1 Цикл

			СтрокаДанных = Объект.ФизическиеУпражения[сч - 1];
			Объект.ФизическиеУпражения.Удалить(СтрокаДанных);

		КонецЦикла;

	КонецЕсли;

	УстановитьВидимостьЗакладокУпражений();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФизическиеУпражнения

&НаКлиенте
Процедура ФизическиеУпраженияУпражнение1ПриИзменении(Элемент)

	ДанныеСтроки = Объект.ФизическиеУпражения[0];
	ДанныеСтроки.Показатель = ПоказательУпражнения(ДанныеСтроки.Упражнение);

КонецПроцедуры

&НаКлиенте
Процедура ФизическиеУпраженияУпражнениеПриИзменении(Элемент)

	ИдСтроки = Элементы.ФизическиеУпражения.ТекущаяСтрока;

	Если ИдСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Объект.ФизическиеУпражения.НайтиПоИдентификатору(ИдСтроки);
	ДанныеСтроки.Показатель = ПоказательУпражнения(ДанныеСтроки.Упражнение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПоказательУпражнения(Упражнение)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упражнение, "Показатель");

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЗакладокУпражений()

	Если НесколькоУпражнений Тогда
		Элементы.ГруппаВариантыЗаписи.ТекущаяСтраница = Элементы.ГруппаНесколькоЗанятий;
	Иначе
		Элементы.ГруппаВариантыЗаписи.ТекущаяСтраница = Элементы.ГруппаОдноЗанятие;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

//@skip-warning
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
